app/views/posts/_form.html.erb

    <%= f.text_area :content %><br>
    <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %>
---
SELECT "tags".* FROM "tags"